1c_um/src/InformationRegisters/ум_ПакетыДанных/ум_ПакетыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ПакетыДанных</name>
  <resources>
    <name>ВременнаяМеткаСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КлючАналитикиПакетаДанных</name>
    <type>
      <types>CatalogRef.ум_КлючиАналитикиПакетовДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующейОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьОбработки</name>
    <comment>Длительность обработки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРабочегоПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПакетПрипаркован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/InformationRegisters/ум_ПакетыДанных/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлементОтбора = ЖурналСобытий.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИдентификаторПакета");	
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = Запись.ИдентификаторПакета;
	ЖурналСобытий.Параметры.УстановитьЗначениеПараметра("ПустойУникальныйИдентификатор", ум_ПакетыДанныхОбщегоНазначения.ПустойУникальныйИдентификатор());
	
	Состояние		= Запись.КлючАналитикиПакетаДанных.СостояниеПакетаДанных;
	СпособОбработки	= Запись.КлючАналитикиПакетаДанных.СпособОбработкиПакетов;  
	
	СтрокаИдентификаторПакета = Запись.ИдентификаторПакета;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НовыйКлючПакета = ум_ПакетыДанныхПовтИсп.ПолучитьКлючАналитикиПакетаДанных(СпособОбработки, Состояние);
	Если НЕ НовыйКлючПакета = ТекущийОбъект.КлючАналитикиПакетаДанных Тогда
		ТекущийОбъект.КлючАналитикиПакетаДанных = НовыйКлючПакета;
	КонецЕсли;    

КонецПроцедуры        

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОбИзменении(Запись.ИсходныйКлючЗаписи);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СпособОбработкиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

#Область ОбработчикиСобытийЭлементовТаблицаЖурналСобытийФормы

&НаКлиенте
Процедура ЖурналСобытийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрокаЖурнала = Элементы.ЖурналСобытий.ТекущиеДанные; 
	Если ТекущаяСтрокаЖурнала = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ЖурналСобытийИндексКартинки Тогда
		
		ИдентификаторРезультатаОбработки = ТекущаяСтрокаЖурнала.ИдентификаторРезультатаОбработки;   
		
		Если ИдентификаторРезультатаОбработки <> ПустойУникальныйИдентификатор() Тогда
			
			СтандартнаяОбработка = Ложь;
			
			АдресХранилищаДанных = ПолучитьДанныеПакетаВХранилище(ИдентификаторРезультатаОбработки);
			ПараметрыФормы = Новый Структура("АдресХранилищаДанных", АдресХранилищаДанных);
			ТекстЗаголовка = СтрШаблон("Данные результата обработки пакета %1", Строка(ИдентификаторРезультатаОбработки));
			ПараметрыФормы.Вставить("Заголовок", ТекстЗаголовка);
			ОткрытьФорму("ОбщаяФорма.ум_ФормаПросмотраДанных",
						 ПараметрыФормы,
						 ЭтаФорма,
						 УникальныйИдентификатор,
						 ,
						 ,
						 ,
						 РежимБлокировкиПриОткрытииОкнаФормы.НеБлокировать
		);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьДанныеПакета(Команда)
	
	АдресХранилищаДанных = ПолучитьДанныеПакетаВХранилище(Запись.ИдентификаторПакета);
	ПараметрыФормы = Новый Структура("АдресХранилищаДанных", АдресХранилищаДанных);
	ТекстЗаголовка = СтрШаблон("Данные пакета %1", Строка(Запись.ИдентификаторПакета));
	ПараметрыФормы.Вставить("Заголовок", ТекстЗаголовка);
	ОткрытьФорму("ОбщаяФорма.ум_ФормаПросмотраДанных",
				 ПараметрыФормы,
				 ЭтаФорма,
				 УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимБлокировкиПриОткрытииОкнаФормы.НеБлокировать
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРезультатОбработкиПакета(Команда)
	
	ТекущаяСтрокаЖурнала = Элементы.ЖурналСобытий.ТекущиеДанные;
	
	Если ТекущаяСтрокаЖурнала = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторРезультатаОбработки = ТекущаяСтрокаЖурнала.ИдентификаторРезультатаОбработки;
	Если ИдентификаторРезультатаОбработки = ПустойУникальныйИдентификатор() Тогда
		Возврат;
	КонецЕсли;
	
	АдресХранилищаДанных = ПолучитьДанныеПакетаВХранилище(ИдентификаторРезультатаОбработки);
	ПараметрыФормы = Новый Структура("АдресХранилищаДанных", АдресХранилищаДанных);
	ТекстЗаголовка = СтрШаблон("Данные результата обработки пакета %1", Строка(ИдентификаторРезультатаОбработки));
	ПараметрыФормы.Вставить("Заголовок", ТекстЗаголовка);
	ОткрытьФорму("ОбщаяФорма.ум_ФормаПросмотраДанных",
				 ПараметрыФормы,
				 ЭтаФорма,
				 УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимБлокировкиПриОткрытииОкнаФормы.НеБлокировать
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПакет(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение( ,"Пакет данных изменен! Для обработки необходимо сохранить изменения.");
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Обработать пакет?";
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",  ЭтаФорма, Параметры);	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Отмена, "Пакеты обработки");
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПустойУникальныйИдентификатор()
	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаПакетаНаСервере();
	
	ОповеститьОбИзменении(Запись.ИсходныйКлючЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПакетаНаСервере()
	
	ум_ПакетыДанных.ОбработатьПакетДанныхВСеансеПользователя(Запись.ИдентификаторПакета);
	
	МенеджерЗаписи = ДанныеФормыВЗначение(Запись, Тип("РегистрСведенийМенеджерЗаписи.ум_ПакетыДанных"));
	МенеджерЗаписи.Прочитать();
	ЗначениеВДанныеФормы(МенеджерЗаписи, Запись);
	
	Состояние		= Запись.КлючАналитикиПакетаДанных.СостояниеПакетаДанных;
	СпособОбработки	= Запись.КлючАналитикиПакетаДанных.СпособОбработкиПакетов;
	
	Элементы.ЖурналСобытий.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПакетаВХранилище(ИдентификаторПакета, ИдентификаторФормы = Неопределено) Экспорт
	Данные = ум_ПакетыДанныхОбщегоНазначения.ПолучитьДанныеПакета(ИдентификаторПакета);
	АдресХранилища = ПоместитьВоВременноеХранилище(Данные, ИдентификаторФормы);
	Возврат АдресХранилища;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
